isEven = lambda x: x % 2 == 0

'''

Лямбда-функция. Плюсы - не обязательно где-то объявлять и явно прописывать, можно налету прописать и вставить код,
если не создаем объект, где указываем напрямую, как однострочную функцию.
Минусы - ограничены одной строкой - не разгуляться.
Плюсы функций - закрытый блок кода, который выполняет определенную логику внутри, можно переиспользовать повторно
в коде. Минусы - конкретно выделить минусы в реализации функций не могу,
могу только сослаться на плохой код, не состыковку названия с итоговым результатом и прочее, что может сделать
плохой неопытный автор функции.

'''